zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211dxx_ca35.h
#define HPDMA2_Channel0_BASE                (HPDMA2_BASE + 0x0050UL)
#define HPDMA2_Channel1_BASE                (HPDMA2_BASE + 0x00D0UL)
#define HPDMA2_Channel2_BASE                (HPDMA2_BASE + 0x0150UL)
#define HPDMA2_Channel3_BASE                (HPDMA2_BASE + 0x01D0UL)
#define HPDMA2_Channel4_BASE                (HPDMA2_BASE + 0x0250UL)
#define HPDMA2_Channel5_BASE                (HPDMA2_BASE + 0x02D0UL)
#define HPDMA2_Channel6_BASE                (HPDMA2_BASE + 0x0350UL)
#define HPDMA2_Channel7_BASE                (HPDMA2_BASE + 0x03D0UL)
#define HPDMA2_Channel8_BASE                (HPDMA2_BASE + 0x0450UL)
#define HPDMA2_Channel9_BASE                (HPDMA2_BASE + 0x04D0UL)
#define HPDMA2_Channel10_BASE               (HPDMA2_BASE + 0x0550UL)
#define HPDMA2_Channel11_BASE               (HPDMA2_BASE + 0x05D0UL)
#define HPDMA2_Channel12_BASE               (HPDMA2_BASE + 0x0650UL)
#define HPDMA2_Channel13_BASE               (HPDMA2_BASE + 0x06D0UL)
#define HPDMA2_Channel14_BASE               (HPDMA2_BASE + 0x0750UL)
#define HPDMA2_Channel15_BASE               (HPDMA2_BASE + 0x07D0UL)

#define HPDMA3_Channel0_BASE                (HPDMA3_BASE + 0x0050UL)
#define HPDMA3_Channel1_BASE                (HPDMA3_BASE + 0x00D0UL)
#define HPDMA3_Channel2_BASE                (HPDMA3_BASE + 0x0150UL)
#define HPDMA3_Channel3_BASE                (HPDMA3_BASE + 0x01D0UL)
#define HPDMA3_Channel4_BASE                (HPDMA3_BASE + 0x0250UL)
#define HPDMA3_Channel5_BASE                (HPDMA3_BASE + 0x02D0UL)
#define HPDMA3_Channel6_BASE                (HPDMA3_BASE + 0x0350UL)
#define HPDMA3_Channel7_BASE                (HPDMA3_BASE + 0x03D0UL)
#define HPDMA3_Channel8_BASE                (HPDMA3_BASE + 0x0450UL)
#define HPDMA3_Channel9_BASE                (HPDMA3_BASE + 0x04D0UL)
#define HPDMA3_Channel10_BASE               (HPDMA3_BASE + 0x0550UL)
#define HPDMA3_Channel11_BASE               (HPDMA3_BASE + 0x05D0UL)
#define HPDMA3_Channel12_BASE               (HPDMA3_BASE + 0x0650UL)
#define HPDMA3_Channel13_BASE               (HPDMA3_BASE + 0x06D0UL)
#define HPDMA3_Channel14_BASE               (HPDMA3_BASE + 0x0750UL)
#define HPDMA3_Channel15_BASE               (HPDMA3_BASE + 0x07D0UL)

/*!< AHB3 peripherals */
#define HASH2_BASE                          (AHB3_PERIPH_BASE + 0x010000UL)
#define HASH2_DIGEST_BASE                   (HASH2_BASE + 0x310UL)
#define RNG2_BASE                           (AHB3_PERIPH_BASE + 0x020000UL)
#define RAMCFG_BASE                         (AHB3_PERIPH_BASE + 0x070000UL)
#define RAMCFG_SYSRAM_BASE                  (RAMCFG_BASE)
#define RAMCFG_SRAM1_BASE                   (RAMCFG_BASE + 0x000080UL)
#define RAMCFG_SRAM2_BASE                   (RAMCFG_BASE + 0x000100UL)
#define RAMCFG_RETRAM_BASE                  (RAMCFG_BASE + 0x000180UL)
#define RAMCFG_BKPSRAM_BASE                 (RAMCFG_BASE + 0x000380UL)
#define RIFSC_BASE                          (AHB3_PERIPH_BASE + 0x080000UL)
#define RISC_BASE                           (RIFSC_BASE)
#define RIMC_BASE                           (RIFSC_BASE + 0xC00UL)
#define RIFSC_ID_BASE                       (RIFSC_BASE + 0xFB0UL)
#define IAC_BASE                            (AHB3_PERIPH_BASE + 0x090000UL)
#define RISAF1_BASE                         (AHB3_PERIPH_BASE + 0x0A0000UL)
#define RISAF2_BASE                         (AHB3_PERIPH_BASE + 0x0B0000UL)
#define RISAF4_BASE                         (AHB3_PERIPH_BASE + 0x0D0000UL)
#define RISAB1_BASE                         (AHB3_PERIPH_BASE + 0x0F0000UL)
#define RISAB2_BASE                         (AHB3_PERIPH_BASE + 0x100000UL)
#define RISAB3_BASE                         (AHB3_PERIPH_BASE + 0x110000UL)
#define RISAB5_BASE                         (AHB3_PERIPH_BASE + 0x130000UL)
#define RISAB6_BASE                         (AHB3_PERIPH_BASE + 0x140000UL)

/*!< APB3 peripherals */
#define BSEC_BASE                           (APB3_PERIPH_BASE + 0x000000UL)
#define IWDG1_BASE                          (APB3_PERIPH_BASE + 0x010000UL)
#define IWDG2_BASE                          (APB3_PERIPH_BASE + 0x020000UL)
#define IWDG3_BASE                          (APB3_PERIPH_BASE + 0x030000UL)
#define IWDG4_BASE                          (APB3_PERIPH_BASE + 0x040000UL)
#define WWDG1_BASE                          (APB3_PERIPH_BASE + 0x050000UL)
#define VREFBUF_BASE                        (APB3_PERIPH_BASE + 0x060000UL)
#define DTS_BASE                            (APB3_PERIPH_BASE + 0x070000UL)
#define SERC_BASE                           (APB3_PERIPH_BASE + 0x080000UL)
#define HDP_BASE                            (APB3_PERIPH_BASE + 0x090000UL)
#define DBGMCU_BASE                         (APB3_PERIPH_BASE + 0x0A0000UL)
/*!< AHB4 peripherals */
#define RCC_BASE                            (AHB4_PERIPH_BASE + 0x00000UL)
#define PWR_BASE                            (AHB4_PERIPH_BASE + 0x10000UL)
#define EXTI1_BASE                          (AHB4_PERIPH_BASE + 0x20000UL)
#define EXTI1_C1_BASE                       (EXTI1_BASE + 0x80UL)
#define EXTI1_C2_BASE                       (EXTI1_BASE + 0xC0UL)
#define EXTI1_C3_BASE                       (EXTI1_BASE + 0x100UL)
#define SYSCFG_BASE                         (AHB4_PERIPH_BASE + 0x30000UL)
#define GPIOA_BASE                          (AHB4_PERIPH_BASE + 0x40000UL)
#define GPIOB_BASE                          (AHB4_PERIPH_BASE + 0x50000UL)
#define GPIOC_BASE                          (AHB4_PERIPH_BASE + 0x60000UL)
#define GPIOD_BASE                          (AHB4_PERIPH_BASE + 0x70000UL)
#define GPIOE_BASE                          (AHB4_PERIPH_BASE + 0x80000UL)
#define GPIOF_BASE                          (AHB4_PERIPH_BASE + 0x90000UL)
#define GPIOG_BASE                          (AHB4_PERIPH_BASE + 0xA0000UL)
#define GPIOH_BASE                          (AHB4_PERIPH_BASE + 0xB0000UL)
#define GPIOI_BASE                          (AHB4_PERIPH_BASE + 0xC0000UL)
#define EXTI2_BASE                          (AHB4_PERIPH_BASE + 0xD0000UL)
#define EXTI2_C1_BASE                       (EXTI2_BASE + 0x80UL)
#define EXTI2_C2_BASE                       (EXTI2_BASE + 0xC0UL)
#define EXTI2_C3_BASE                       (EXTI2_BASE + 0x100UL)

/*!< SMART_RUN_APB peripherals */
#define RTC_BASE                            (SMART_RUN_APB_PERIPH_BASE + 0x00000UL)
#define TAMP_BASE                           (SMART_RUN_APB_PERIPH_BASE + 0x10000UL)
#define SPI6_BASE                           (SMART_RUN_APB_PERIPH_BASE + 0x20000UL)
#define LPUART1_BASE                        (SMART_RUN_APB_PERIPH_BASE + 0x30000UL)
#define I2C3_BASE                           (SMART_RUN_APB_PERIPH_BASE + 0x40000UL)
#define LPTIM3_BASE                         (SMART_RUN_APB_PERIPH_BASE + 0x50000UL)
#define LPTIM4_BASE                         (SMART_RUN_APB_PERIPH_BASE + 0x60000UL)
#define LPTIM5_BASE                         (SMART_RUN_APB_PERIPH_BASE + 0x70000UL)
#define I3C3_BASE                           (SMART_RUN_APB_PERIPH_BASE + 0x80000UL)

/*!< SMART_RUN_AHB peripherals */
#define GPIOZ_BASE                          (SMART_RUN_AHB_PERIPH_BASE + 0x00000UL)
#define ADF1_BASE                           (SMART_RUN_AHB_PERIPH_BASE + 0x20000UL)
#define ADF1_Filter0_BASE                   (ADF1_BASE + 0x80UL)

/*!< APB4 peripherals */
#define LTDC_BASE                           (APB4_PERIPH_BASE + 0x10000UL)
#define LTDC_Layer1_BASE                    (LTDC_BASE + 0x100UL)
#define LTDC_Layer2_BASE                    (LTDC_BASE + 0x200UL)
#define LTDC_Layer3_BASE                    (LTDC_BASE + 0x300UL)
#define DCMIPP_BASE                         (APB4_PERIPH_BASE + 0x30000UL)
#define DDRC_BASE                           (APB4_PERIPH_BASE + 0x40000UL)
#define DDRDBG_BASE                         (APB4_PERIPH_BASE + 0x50000UL)
#define STGENR_BASE                         (APB4_PERIPH_BASE + 0x70000UL)
#define STGENC_BASE                         (APB4_PERIPH_BASE + 0x80000UL)
#define ATG_BASE                            (APB4_PERIPH_BASE + 0x90000UL)
#define BUSPERFM_BASE                       (APB4_PERIPH_BASE + 0xB0000UL)
#define DDRPERFM_BASE                       (APB4_PERIPH_BASE + 0xC0000UL)
/*!< AHB5 peripherals */
#define FMC_BASE                            (AHB5_PERIPH_BASE + 0x000000UL)
#define SDMMC1_BASE                         (AHB5_PERIPH_BASE + 0x020000UL)
#define SDMMC2_BASE                         (AHB5_PERIPH_BASE + 0x030000UL)
#define SDMMC3_BASE                         (AHB5_PERIPH_BASE + 0x040000UL)
#define ETH1_BASE                           (AHB5_PERIPH_BASE + 0x0C0000UL)
#define USBH_OHCI_BASE                      (AHB5_PERIPH_BASE + 0x0E0000UL)
#define USBH_EHCI_BASE                      (AHB5_PERIPH_BASE + 0x0F0000UL)
#define USBDR_BASE                          (AHB5_PERIPH_BASE + 0x100000UL)
#define PCIE_BASE                           (AHB5_PERIPH_BASE + 0x200000UL)
#define CA35SSC_BASE                        (AHB5_PERIPH_BASE + 0x600000UL)
#define CA35SYSCFG_BASE                     (AHB5_PERIPH_BASE + 0x602000UL)
#define FMC_NAND_DATA_BASE                  (AHB5_PERIPH_BASE + 0x610000UL)
#define DDRPHYC_BASE                        (AHB5_PERIPH_BASE + 0xA00000UL)


