zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211dxx_ca35.h
/* Bit fields for RCC_TIM8CFGR register */
#define RCC_TIM8CFGR_TIM8RST_Pos                   (0U)
#define RCC_TIM8CFGR_TIM8RST_Msk                   (0x1UL << RCC_TIM8CFGR_TIM8RST_Pos)                  /*!< 0x00000001 */
#define RCC_TIM8CFGR_TIM8RST                       RCC_TIM8CFGR_TIM8RST_Msk                          /*!< TIM8 reset */
#define RCC_TIM8CFGR_TIM8EN_Pos                    (1U)
#define RCC_TIM8CFGR_TIM8EN_Msk                    (0x1UL << RCC_TIM8CFGR_TIM8EN_Pos)                   /*!< 0x00000002 */
#define RCC_TIM8CFGR_TIM8EN                        RCC_TIM8CFGR_TIM8EN_Msk                           /*!< TIM8 clock enable */
#define RCC_TIM8CFGR_TIM8LPEN_Pos                  (2U)
#define RCC_TIM8CFGR_TIM8LPEN_Msk                  (0x1UL << RCC_TIM8CFGR_TIM8LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_TIM8CFGR_TIM8LPEN                      RCC_TIM8CFGR_TIM8LPEN_Msk                         /*!< TIM8 clock enable during CSleep */

/* Bit fields for RCC_TIM10CFGR register */
#define RCC_TIM10CFGR_TIM10RST_Pos                 (0U)
#define RCC_TIM10CFGR_TIM10RST_Msk                 (0x1UL << RCC_TIM10CFGR_TIM10RST_Pos)                /*!< 0x00000001 */
#define RCC_TIM10CFGR_TIM10RST                     RCC_TIM10CFGR_TIM10RST_Msk                        /*!< TIM10 reset */
#define RCC_TIM10CFGR_TIM10EN_Pos                  (1U)
#define RCC_TIM10CFGR_TIM10EN_Msk                  (0x1UL << RCC_TIM10CFGR_TIM10EN_Pos)                 /*!< 0x00000002 */
#define RCC_TIM10CFGR_TIM10EN                      RCC_TIM10CFGR_TIM10EN_Msk                         /*!< TIM10 clock enable */
#define RCC_TIM10CFGR_TIM10LPEN_Pos                (2U)
#define RCC_TIM10CFGR_TIM10LPEN_Msk                (0x1UL << RCC_TIM10CFGR_TIM10LPEN_Pos)               /*!< 0x00000004 */
#define RCC_TIM10CFGR_TIM10LPEN                    RCC_TIM10CFGR_TIM10LPEN_Msk                       /*!< TIM10 clock enable during CSleep */

/* Bit fields for RCC_TIM11CFGR register */
#define RCC_TIM11CFGR_TIM11RST_Pos                 (0U)
#define RCC_TIM11CFGR_TIM11RST_Msk                 (0x1UL << RCC_TIM11CFGR_TIM11RST_Pos)                /*!< 0x00000001 */
#define RCC_TIM11CFGR_TIM11RST                     RCC_TIM11CFGR_TIM11RST_Msk                        /*!< TIM11 reset */
#define RCC_TIM11CFGR_TIM11EN_Pos                  (1U)
#define RCC_TIM11CFGR_TIM11EN_Msk                  (0x1UL << RCC_TIM11CFGR_TIM11EN_Pos)                 /*!< 0x00000002 */
#define RCC_TIM11CFGR_TIM11EN                      RCC_TIM11CFGR_TIM11EN_Msk                         /*!< TIM11 clock enable */
#define RCC_TIM11CFGR_TIM11LPEN_Pos                (2U)
#define RCC_TIM11CFGR_TIM11LPEN_Msk                (0x1UL << RCC_TIM11CFGR_TIM11LPEN_Pos)               /*!< 0x00000004 */
#define RCC_TIM11CFGR_TIM11LPEN                    RCC_TIM11CFGR_TIM11LPEN_Msk                       /*!< TIM11 clock enable during CSleep */

/* Bit fields for RCC_TIM12CFGR register */
#define RCC_TIM12CFGR_TIM12RST_Pos                 (0U)
#define RCC_TIM12CFGR_TIM12RST_Msk                 (0x1UL << RCC_TIM12CFGR_TIM12RST_Pos)                /*!< 0x00000001 */
#define RCC_TIM12CFGR_TIM12RST                     RCC_TIM12CFGR_TIM12RST_Msk                        /*!< TIM12 reset */
#define RCC_TIM12CFGR_TIM12EN_Pos                  (1U)
#define RCC_TIM12CFGR_TIM12EN_Msk                  (0x1UL << RCC_TIM12CFGR_TIM12EN_Pos)                 /*!< 0x00000002 */
#define RCC_TIM12CFGR_TIM12EN                      RCC_TIM12CFGR_TIM12EN_Msk                         /*!< TIM12 clock enable */
#define RCC_TIM12CFGR_TIM12LPEN_Pos                (2U)
#define RCC_TIM12CFGR_TIM12LPEN_Msk                (0x1UL << RCC_TIM12CFGR_TIM12LPEN_Pos)               /*!< 0x00000004 */
#define RCC_TIM12CFGR_TIM12LPEN                    RCC_TIM12CFGR_TIM12LPEN_Msk                       /*!< TIM12 clock enable during CSleep */

/* Bit fields for RCC_TIM13CFGR register */
#define RCC_TIM13CFGR_TIM13RST_Pos                 (0U)
#define RCC_TIM13CFGR_TIM13RST_Msk                 (0x1UL << RCC_TIM13CFGR_TIM13RST_Pos)                /*!< 0x00000001 */
#define RCC_TIM13CFGR_TIM13RST                     RCC_TIM13CFGR_TIM13RST_Msk                        /*!< TIM13 reset */
#define RCC_TIM13CFGR_TIM13EN_Pos                  (1U)
#define RCC_TIM13CFGR_TIM13EN_Msk                  (0x1UL << RCC_TIM13CFGR_TIM13EN_Pos)                 /*!< 0x00000002 */
#define RCC_TIM13CFGR_TIM13EN                      RCC_TIM13CFGR_TIM13EN_Msk                         /*!< TIM13 clock enable */
#define RCC_TIM13CFGR_TIM13LPEN_Pos                (2U)
#define RCC_TIM13CFGR_TIM13LPEN_Msk                (0x1UL << RCC_TIM13CFGR_TIM13LPEN_Pos)               /*!< 0x00000004 */
#define RCC_TIM13CFGR_TIM13LPEN                    RCC_TIM13CFGR_TIM13LPEN_Msk                       /*!< TIM13 clock enable during CSleep */

/* Bit fields for RCC_TIM14CFGR register */
#define RCC_TIM14CFGR_TIM14RST_Pos                 (0U)
#define RCC_TIM14CFGR_TIM14RST_Msk                 (0x1UL << RCC_TIM14CFGR_TIM14RST_Pos)                /*!< 0x00000001 */
#define RCC_TIM14CFGR_TIM14RST                     RCC_TIM14CFGR_TIM14RST_Msk                        /*!< TIM14 reset */
#define RCC_TIM14CFGR_TIM14EN_Pos                  (1U)
#define RCC_TIM14CFGR_TIM14EN_Msk                  (0x1UL << RCC_TIM14CFGR_TIM14EN_Pos)                 /*!< 0x00000002 */
#define RCC_TIM14CFGR_TIM14EN                      RCC_TIM14CFGR_TIM14EN_Msk                         /*!< TIM14 clock enable */
#define RCC_TIM14CFGR_TIM14LPEN_Pos                (2U)
#define RCC_TIM14CFGR_TIM14LPEN_Msk                (0x1UL << RCC_TIM14CFGR_TIM14LPEN_Pos)               /*!< 0x00000004 */
#define RCC_TIM14CFGR_TIM14LPEN                    RCC_TIM14CFGR_TIM14LPEN_Msk                       /*!< TIM14 clock enable during CSleep */

/* Bit fields for RCC_TIM15CFGR register */
#define RCC_TIM15CFGR_TIM15RST_Pos                 (0U)
#define RCC_TIM15CFGR_TIM15RST_Msk                 (0x1UL << RCC_TIM15CFGR_TIM15RST_Pos)                /*!< 0x00000001 */
#define RCC_TIM15CFGR_TIM15RST                     RCC_TIM15CFGR_TIM15RST_Msk                        /*!< TIM15 reset */
#define RCC_TIM15CFGR_TIM15EN_Pos                  (1U)
#define RCC_TIM15CFGR_TIM15EN_Msk                  (0x1UL << RCC_TIM15CFGR_TIM15EN_Pos)                 /*!< 0x00000002 */
#define RCC_TIM15CFGR_TIM15EN                      RCC_TIM15CFGR_TIM15EN_Msk                         /*!< TIM15 clock enable */
#define RCC_TIM15CFGR_TIM15LPEN_Pos                (2U)
#define RCC_TIM15CFGR_TIM15LPEN_Msk                (0x1UL << RCC_TIM15CFGR_TIM15LPEN_Pos)               /*!< 0x00000004 */
#define RCC_TIM15CFGR_TIM15LPEN                    RCC_TIM15CFGR_TIM15LPEN_Msk                       /*!< TIM15 clock enable during CSleep */

/* Bit fields for RCC_TIM16CFGR register */
#define RCC_TIM16CFGR_TIM16RST_Pos                 (0U)
#define RCC_TIM16CFGR_TIM16RST_Msk                 (0x1UL << RCC_TIM16CFGR_TIM16RST_Pos)                /*!< 0x00000001 */
#define RCC_TIM16CFGR_TIM16RST                     RCC_TIM16CFGR_TIM16RST_Msk                        /*!< TIM16 reset */
#define RCC_TIM16CFGR_TIM16EN_Pos                  (1U)
#define RCC_TIM16CFGR_TIM16EN_Msk                  (0x1UL << RCC_TIM16CFGR_TIM16EN_Pos)                 /*!< 0x00000002 */
#define RCC_TIM16CFGR_TIM16EN                      RCC_TIM16CFGR_TIM16EN_Msk                         /*!< TIM16 clock enable */
#define RCC_TIM16CFGR_TIM16LPEN_Pos                (2U)
#define RCC_TIM16CFGR_TIM16LPEN_Msk                (0x1UL << RCC_TIM16CFGR_TIM16LPEN_Pos)               /*!< 0x00000004 */
#define RCC_TIM16CFGR_TIM16LPEN                    RCC_TIM16CFGR_TIM16LPEN_Msk                       /*!< TIM16 clock enable during CSleep */

/* Bit fields for RCC_TIM17CFGR register */
#define RCC_TIM17CFGR_TIM17RST_Pos                 (0U)
#define RCC_TIM17CFGR_TIM17RST_Msk                 (0x1UL << RCC_TIM17CFGR_TIM17RST_Pos)                /*!< 0x00000001 */
#define RCC_TIM17CFGR_TIM17RST                     RCC_TIM17CFGR_TIM17RST_Msk                        /*!< TIM17 reset */
#define RCC_TIM17CFGR_TIM17EN_Pos                  (1U)
#define RCC_TIM17CFGR_TIM17EN_Msk                  (0x1UL << RCC_TIM17CFGR_TIM17EN_Pos)                 /*!< 0x00000002 */
#define RCC_TIM17CFGR_TIM17EN                      RCC_TIM17CFGR_TIM17EN_Msk                         /*!< TIM17 clock enable */
#define RCC_TIM17CFGR_TIM17LPEN_Pos                (2U)
#define RCC_TIM17CFGR_TIM17LPEN_Msk                (0x1UL << RCC_TIM17CFGR_TIM17LPEN_Pos)               /*!< 0x00000004 */
#define RCC_TIM17CFGR_TIM17LPEN                    RCC_TIM17CFGR_TIM17LPEN_Msk                       /*!< TIM17 clock enable during CSleep */

