zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211dxx_ca35.h
/*******************  Bits definition for IAC_ISR0 register *******************/
#define IAC_ISR0_IAF0_Pos             (0U)
#define IAC_ISR0_IAF0_Msk             (0x1UL << IAC_ISR0_IAF0_Pos)               /*!< 0x00000001 */
#define IAC_ISR0_IAF0                 IAC_ISR0_IAF0_Msk
#define IAC_ISR0_IAF1_Pos             (1U)
#define IAC_ISR0_IAF1_Msk             (0x1UL << IAC_ISR0_IAF1_Pos)               /*!< 0x00000002 */
#define IAC_ISR0_IAF1                 IAC_ISR0_IAF1_Msk
#define IAC_ISR0_IAF2_Pos             (2U)
#define IAC_ISR0_IAF2_Msk             (0x1UL << IAC_ISR0_IAF2_Pos)               /*!< 0x00000004 */
#define IAC_ISR0_IAF2                 IAC_ISR0_IAF2_Msk
#define IAC_ISR0_IAF3_Pos             (3U)
#define IAC_ISR0_IAF3_Msk             (0x1UL << IAC_ISR0_IAF3_Pos)               /*!< 0x00000008 */
#define IAC_ISR0_IAF3                 IAC_ISR0_IAF3_Msk
#define IAC_ISR0_IAF4_Pos             (4U)
#define IAC_ISR0_IAF4_Msk             (0x1UL << IAC_ISR0_IAF4_Pos)               /*!< 0x00000010 */
#define IAC_ISR0_IAF4                 IAC_ISR0_IAF4_Msk
#define IAC_ISR0_IAF5_Pos             (5U)
#define IAC_ISR0_IAF5_Msk             (0x1UL << IAC_ISR0_IAF5_Pos)               /*!< 0x00000020 */
#define IAC_ISR0_IAF5                 IAC_ISR0_IAF5_Msk
#define IAC_ISR0_IAF6_Pos             (6U)
#define IAC_ISR0_IAF6_Msk             (0x1UL << IAC_ISR0_IAF6_Pos)               /*!< 0x00000040 */
#define IAC_ISR0_IAF6                 IAC_ISR0_IAF6_Msk
#define IAC_ISR0_IAF7_Pos             (7U)
#define IAC_ISR0_IAF7_Msk             (0x1UL << IAC_ISR0_IAF7_Pos)               /*!< 0x00000080 */
#define IAC_ISR0_IAF7                 IAC_ISR0_IAF7_Msk
#define IAC_ISR0_IAF8_Pos             (8U)
#define IAC_ISR0_IAF8_Msk             (0x1UL << IAC_ISR0_IAF8_Pos)               /*!< 0x00000100 */
#define IAC_ISR0_IAF8                 IAC_ISR0_IAF8_Msk
#define IAC_ISR0_IAF9_Pos             (9U)
#define IAC_ISR0_IAF9_Msk             (0x1UL << IAC_ISR0_IAF9_Pos)               /*!< 0x00000200 */
#define IAC_ISR0_IAF9                 IAC_ISR0_IAF9_Msk
#define IAC_ISR0_IAF10_Pos            (10U)
#define IAC_ISR0_IAF10_Msk            (0x1UL << IAC_ISR0_IAF10_Pos)              /*!< 0x00000400 */
#define IAC_ISR0_IAF10                IAC_ISR0_IAF10_Msk
#define IAC_ISR0_IAF11_Pos            (11U)
#define IAC_ISR0_IAF11_Msk            (0x1UL << IAC_ISR0_IAF11_Pos)              /*!< 0x00000800 */
#define IAC_ISR0_IAF11                IAC_ISR0_IAF11_Msk
#define IAC_ISR0_IAF12_Pos            (12U)
#define IAC_ISR0_IAF12_Msk            (0x1UL << IAC_ISR0_IAF12_Pos)              /*!< 0x00001000 */
#define IAC_ISR0_IAF12                IAC_ISR0_IAF12_Msk
#define IAC_ISR0_IAF13_Pos            (13U)
#define IAC_ISR0_IAF13_Msk            (0x1UL << IAC_ISR0_IAF13_Pos)              /*!< 0x00002000 */
#define IAC_ISR0_IAF13                IAC_ISR0_IAF13_Msk
#define IAC_ISR0_IAF14_Pos            (14U)
#define IAC_ISR0_IAF14_Msk            (0x1UL << IAC_ISR0_IAF14_Pos)              /*!< 0x00004000 */
#define IAC_ISR0_IAF14                IAC_ISR0_IAF14_Msk
#define IAC_ISR0_IAF15_Pos            (15U)
#define IAC_ISR0_IAF15_Msk            (0x1UL << IAC_ISR0_IAF15_Pos)              /*!< 0x00008000 */
#define IAC_ISR0_IAF15                IAC_ISR0_IAF15_Msk
#define IAC_ISR0_IAF16_Pos            (16U)
#define IAC_ISR0_IAF16_Msk            (0x1UL << IAC_ISR0_IAF16_Pos)              /*!< 0x00010000 */
#define IAC_ISR0_IAF16                IAC_ISR0_IAF16_Msk
#define IAC_ISR0_IAF17_Pos            (17U)
#define IAC_ISR0_IAF17_Msk            (0x1UL << IAC_ISR0_IAF17_Pos)              /*!< 0x00020000 */
#define IAC_ISR0_IAF17                IAC_ISR0_IAF17_Msk
#define IAC_ISR0_IAF18_Pos            (18U)
#define IAC_ISR0_IAF18_Msk            (0x1UL << IAC_ISR0_IAF18_Pos)              /*!< 0x00040000 */
#define IAC_ISR0_IAF18                IAC_ISR0_IAF18_Msk
#define IAC_ISR0_IAF19_Pos            (19U)
#define IAC_ISR0_IAF19_Msk            (0x1UL << IAC_ISR0_IAF19_Pos)              /*!< 0x00080000 */
#define IAC_ISR0_IAF19                IAC_ISR0_IAF19_Msk
#define IAC_ISR0_IAF20_Pos            (20U)
#define IAC_ISR0_IAF20_Msk            (0x1UL << IAC_ISR0_IAF20_Pos)              /*!< 0x00100000 */
#define IAC_ISR0_IAF20                IAC_ISR0_IAF20_Msk
#define IAC_ISR0_IAF21_Pos            (21U)
#define IAC_ISR0_IAF21_Msk            (0x1UL << IAC_ISR0_IAF21_Pos)              /*!< 0x00200000 */
#define IAC_ISR0_IAF21                IAC_ISR0_IAF21_Msk
#define IAC_ISR0_IAF22_Pos            (22U)
#define IAC_ISR0_IAF22_Msk            (0x1UL << IAC_ISR0_IAF22_Pos)              /*!< 0x00400000 */
#define IAC_ISR0_IAF22                IAC_ISR0_IAF22_Msk
#define IAC_ISR0_IAF23_Pos            (23U)
#define IAC_ISR0_IAF23_Msk            (0x1UL << IAC_ISR0_IAF23_Pos)              /*!< 0x00800000 */
#define IAC_ISR0_IAF23                IAC_ISR0_IAF23_Msk
#define IAC_ISR0_IAF24_Pos            (24U)
#define IAC_ISR0_IAF24_Msk            (0x1UL << IAC_ISR0_IAF24_Pos)              /*!< 0x01000000 */
#define IAC_ISR0_IAF24                IAC_ISR0_IAF24_Msk
#define IAC_ISR0_IAF25_Pos            (25U)
#define IAC_ISR0_IAF25_Msk            (0x1UL << IAC_ISR0_IAF25_Pos)              /*!< 0x02000000 */
#define IAC_ISR0_IAF25                IAC_ISR0_IAF25_Msk
#define IAC_ISR0_IAF26_Pos            (26U)
#define IAC_ISR0_IAF26_Msk            (0x1UL << IAC_ISR0_IAF26_Pos)              /*!< 0x04000000 */
#define IAC_ISR0_IAF26                IAC_ISR0_IAF26_Msk
#define IAC_ISR0_IAF27_Pos            (27U)
#define IAC_ISR0_IAF27_Msk            (0x1UL << IAC_ISR0_IAF27_Pos)              /*!< 0x08000000 */
#define IAC_ISR0_IAF27                IAC_ISR0_IAF27_Msk
#define IAC_ISR0_IAF28_Pos            (28U)
#define IAC_ISR0_IAF28_Msk            (0x1UL << IAC_ISR0_IAF28_Pos)              /*!< 0x10000000 */
#define IAC_ISR0_IAF28                IAC_ISR0_IAF28_Msk
#define IAC_ISR0_IAF29_Pos            (29U)
#define IAC_ISR0_IAF29_Msk            (0x1UL << IAC_ISR0_IAF29_Pos)              /*!< 0x20000000 */
#define IAC_ISR0_IAF29                IAC_ISR0_IAF29_Msk
#define IAC_ISR0_IAF30_Pos            (30U)
#define IAC_ISR0_IAF30_Msk            (0x1UL << IAC_ISR0_IAF30_Pos)              /*!< 0x40000000 */
#define IAC_ISR0_IAF30                IAC_ISR0_IAF30_Msk
#define IAC_ISR0_IAF31_Pos            (31U)
#define IAC_ISR0_IAF31_Msk            (0x1UL << IAC_ISR0_IAF31_Pos)              /*!< 0x80000000 */
#define IAC_ISR0_IAF31                IAC_ISR0_IAF31_Msk

/*******************  Bits definition for IAC_ISR1 register *******************/
#define IAC_ISR1_IAF32_Pos            (0U)
#define IAC_ISR1_IAF32_Msk            (0x1UL << IAC_ISR1_IAF32_Pos)              /*!< 0x00000001 */
#define IAC_ISR1_IAF32                IAC_ISR1_IAF32_Msk
#define IAC_ISR1_IAF33_Pos            (1U)
#define IAC_ISR1_IAF33_Msk            (0x1UL << IAC_ISR1_IAF33_Pos)              /*!< 0x00000002 */
#define IAC_ISR1_IAF33                IAC_ISR1_IAF33_Msk
#define IAC_ISR1_IAF34_Pos            (2U)
#define IAC_ISR1_IAF34_Msk            (0x1UL << IAC_ISR1_IAF34_Pos)              /*!< 0x00000004 */
#define IAC_ISR1_IAF34                IAC_ISR1_IAF34_Msk
#define IAC_ISR1_IAF35_Pos            (3U)
#define IAC_ISR1_IAF35_Msk            (0x1UL << IAC_ISR1_IAF35_Pos)              /*!< 0x00000008 */
#define IAC_ISR1_IAF35                IAC_ISR1_IAF35_Msk
#define IAC_ISR1_IAF36_Pos            (4U)
#define IAC_ISR1_IAF36_Msk            (0x1UL << IAC_ISR1_IAF36_Pos)              /*!< 0x00000010 */
#define IAC_ISR1_IAF36                IAC_ISR1_IAF36_Msk
#define IAC_ISR1_IAF37_Pos            (5U)
#define IAC_ISR1_IAF37_Msk            (0x1UL << IAC_ISR1_IAF37_Pos)              /*!< 0x00000020 */
#define IAC_ISR1_IAF37                IAC_ISR1_IAF37_Msk
#define IAC_ISR1_IAF38_Pos            (6U)
#define IAC_ISR1_IAF38_Msk            (0x1UL << IAC_ISR1_IAF38_Pos)              /*!< 0x00000040 */
#define IAC_ISR1_IAF38                IAC_ISR1_IAF38_Msk
#define IAC_ISR1_IAF39_Pos            (7U)
#define IAC_ISR1_IAF39_Msk            (0x1UL << IAC_ISR1_IAF39_Pos)              /*!< 0x00000080 */
#define IAC_ISR1_IAF39                IAC_ISR1_IAF39_Msk
#define IAC_ISR1_IAF40_Pos            (8U)
#define IAC_ISR1_IAF40_Msk            (0x1UL << IAC_ISR1_IAF40_Pos)              /*!< 0x00000100 */
#define IAC_ISR1_IAF40                IAC_ISR1_IAF40_Msk
#define IAC_ISR1_IAF41_Pos            (9U)
#define IAC_ISR1_IAF41_Msk            (0x1UL << IAC_ISR1_IAF41_Pos)              /*!< 0x00000200 */
#define IAC_ISR1_IAF41                IAC_ISR1_IAF41_Msk
#define IAC_ISR1_IAF42_Pos            (10U)
#define IAC_ISR1_IAF42_Msk            (0x1UL << IAC_ISR1_IAF42_Pos)              /*!< 0x00000400 */
#define IAC_ISR1_IAF42                IAC_ISR1_IAF42_Msk
#define IAC_ISR1_IAF43_Pos            (11U)
#define IAC_ISR1_IAF43_Msk            (0x1UL << IAC_ISR1_IAF43_Pos)              /*!< 0x00000800 */
#define IAC_ISR1_IAF43                IAC_ISR1_IAF43_Msk
#define IAC_ISR1_IAF44_Pos            (12U)
#define IAC_ISR1_IAF44_Msk            (0x1UL << IAC_ISR1_IAF44_Pos)              /*!< 0x00001000 */
#define IAC_ISR1_IAF44                IAC_ISR1_IAF44_Msk
#define IAC_ISR1_IAF45_Pos            (13U)
#define IAC_ISR1_IAF45_Msk            (0x1UL << IAC_ISR1_IAF45_Pos)              /*!< 0x00002000 */
#define IAC_ISR1_IAF45                IAC_ISR1_IAF45_Msk
#define IAC_ISR1_IAF46_Pos            (14U)
#define IAC_ISR1_IAF46_Msk            (0x1UL << IAC_ISR1_IAF46_Pos)              /*!< 0x00004000 */
#define IAC_ISR1_IAF46                IAC_ISR1_IAF46_Msk
#define IAC_ISR1_IAF47_Pos            (15U)
#define IAC_ISR1_IAF47_Msk            (0x1UL << IAC_ISR1_IAF47_Pos)              /*!< 0x00008000 */
#define IAC_ISR1_IAF47                IAC_ISR1_IAF47_Msk
#define IAC_ISR1_IAF48_Pos            (16U)
#define IAC_ISR1_IAF48_Msk            (0x1UL << IAC_ISR1_IAF48_Pos)              /*!< 0x00010000 */
#define IAC_ISR1_IAF48                IAC_ISR1_IAF48_Msk
#define IAC_ISR1_IAF49_Pos            (17U)
#define IAC_ISR1_IAF49_Msk            (0x1UL << IAC_ISR1_IAF49_Pos)              /*!< 0x00020000 */
#define IAC_ISR1_IAF49                IAC_ISR1_IAF49_Msk
#define IAC_ISR1_IAF50_Pos            (18U)
#define IAC_ISR1_IAF50_Msk            (0x1UL << IAC_ISR1_IAF50_Pos)              /*!< 0x00040000 */
#define IAC_ISR1_IAF50                IAC_ISR1_IAF50_Msk
#define IAC_ISR1_IAF51_Pos            (19U)
#define IAC_ISR1_IAF51_Msk            (0x1UL << IAC_ISR1_IAF51_Pos)              /*!< 0x00080000 */
#define IAC_ISR1_IAF51                IAC_ISR1_IAF51_Msk
#define IAC_ISR1_IAF52_Pos            (20U)
#define IAC_ISR1_IAF52_Msk            (0x1UL << IAC_ISR1_IAF52_Pos)              /*!< 0x00100000 */
#define IAC_ISR1_IAF52                IAC_ISR1_IAF52_Msk
#define IAC_ISR1_IAF53_Pos            (21U)
#define IAC_ISR1_IAF53_Msk            (0x1UL << IAC_ISR1_IAF53_Pos)              /*!< 0x00200000 */
#define IAC_ISR1_IAF53                IAC_ISR1_IAF53_Msk
#define IAC_ISR1_IAF54_Pos            (22U)
#define IAC_ISR1_IAF54_Msk            (0x1UL << IAC_ISR1_IAF54_Pos)              /*!< 0x00400000 */
#define IAC_ISR1_IAF54                IAC_ISR1_IAF54_Msk
#define IAC_ISR1_IAF55_Pos            (23U)
#define IAC_ISR1_IAF55_Msk            (0x1UL << IAC_ISR1_IAF55_Pos)              /*!< 0x00800000 */
#define IAC_ISR1_IAF55                IAC_ISR1_IAF55_Msk
#define IAC_ISR1_IAF56_Pos            (24U)
#define IAC_ISR1_IAF56_Msk            (0x1UL << IAC_ISR1_IAF56_Pos)              /*!< 0x01000000 */
#define IAC_ISR1_IAF56                IAC_ISR1_IAF56_Msk
#define IAC_ISR1_IAF57_Pos            (25U)
#define IAC_ISR1_IAF57_Msk            (0x1UL << IAC_ISR1_IAF57_Pos)              /*!< 0x02000000 */
#define IAC_ISR1_IAF57                IAC_ISR1_IAF57_Msk
#define IAC_ISR1_IAF58_Pos            (26U)
#define IAC_ISR1_IAF58_Msk            (0x1UL << IAC_ISR1_IAF58_Pos)              /*!< 0x04000000 */
#define IAC_ISR1_IAF58                IAC_ISR1_IAF58_Msk
#define IAC_ISR1_IAF59_Pos            (27U)
#define IAC_ISR1_IAF59_Msk            (0x1UL << IAC_ISR1_IAF59_Pos)              /*!< 0x08000000 */
#define IAC_ISR1_IAF59                IAC_ISR1_IAF59_Msk
#define IAC_ISR1_IAF60_Pos            (28U)
#define IAC_ISR1_IAF60_Msk            (0x1UL << IAC_ISR1_IAF60_Pos)              /*!< 0x10000000 */
#define IAC_ISR1_IAF60                IAC_ISR1_IAF60_Msk
#define IAC_ISR1_IAF61_Pos            (29U)
#define IAC_ISR1_IAF61_Msk            (0x1UL << IAC_ISR1_IAF61_Pos)              /*!< 0x20000000 */
#define IAC_ISR1_IAF61                IAC_ISR1_IAF61_Msk
#define IAC_ISR1_IAF62_Pos            (30U)
#define IAC_ISR1_IAF62_Msk            (0x1UL << IAC_ISR1_IAF62_Pos)              /*!< 0x40000000 */
#define IAC_ISR1_IAF62                IAC_ISR1_IAF62_Msk
#define IAC_ISR1_IAF63_Pos            (31U)
#define IAC_ISR1_IAF63_Msk            (0x1UL << IAC_ISR1_IAF63_Pos)              /*!< 0x80000000 */
#define IAC_ISR1_IAF63                IAC_ISR1_IAF63_Msk

/*******************  Bits definition for IAC_ISR2 register *******************/
#define IAC_ISR2_IAF64_Pos            (0U)
#define IAC_ISR2_IAF64_Msk            (0x1UL << IAC_ISR2_IAF64_Pos)              /*!< 0x00000001 */
#define IAC_ISR2_IAF64                IAC_ISR2_IAF64_Msk
#define IAC_ISR2_IAF65_Pos            (1U)
#define IAC_ISR2_IAF65_Msk            (0x1UL << IAC_ISR2_IAF65_Pos)              /*!< 0x00000002 */
#define IAC_ISR2_IAF65                IAC_ISR2_IAF65_Msk
#define IAC_ISR2_IAF66_Pos            (2U)
#define IAC_ISR2_IAF66_Msk            (0x1UL << IAC_ISR2_IAF66_Pos)              /*!< 0x00000004 */
#define IAC_ISR2_IAF66                IAC_ISR2_IAF66_Msk
#define IAC_ISR2_IAF67_Pos            (3U)
#define IAC_ISR2_IAF67_Msk            (0x1UL << IAC_ISR2_IAF67_Pos)              /*!< 0x00000008 */
#define IAC_ISR2_IAF67                IAC_ISR2_IAF67_Msk
#define IAC_ISR2_IAF68_Pos            (4U)
#define IAC_ISR2_IAF68_Msk            (0x1UL << IAC_ISR2_IAF68_Pos)              /*!< 0x00000010 */
#define IAC_ISR2_IAF68                IAC_ISR2_IAF68_Msk
#define IAC_ISR2_IAF69_Pos            (5U)
#define IAC_ISR2_IAF69_Msk            (0x1UL << IAC_ISR2_IAF69_Pos)              /*!< 0x00000020 */
#define IAC_ISR2_IAF69                IAC_ISR2_IAF69_Msk
#define IAC_ISR2_IAF70_Pos            (6U)
#define IAC_ISR2_IAF70_Msk            (0x1UL << IAC_ISR2_IAF70_Pos)              /*!< 0x00000040 */
#define IAC_ISR2_IAF70                IAC_ISR2_IAF70_Msk
#define IAC_ISR2_IAF71_Pos            (7U)
#define IAC_ISR2_IAF71_Msk            (0x1UL << IAC_ISR2_IAF71_Pos)              /*!< 0x00000080 */
#define IAC_ISR2_IAF71                 IAC_ISR2_IAF71_Msk
#define IAC_ISR2_IAF72_Pos            (8U)
#define IAC_ISR2_IAF72_Msk            (0x1UL << IAC_ISR2_IAF72_Pos)              /*!< 0x00000100 */
#define IAC_ISR2_IAF72                IAC_ISR2_IAF72_Msk
#define IAC_ISR2_IAF73_Pos            (9U)
#define IAC_ISR2_IAF73_Msk            (0x1UL << IAC_ISR2_IAF73_Pos)              /*!< 0x00000200 */
#define IAC_ISR2_IAF73                IAC_ISR2_IAF73_Msk
#define IAC_ISR2_IAF74_Pos            (10U)
#define IAC_ISR2_IAF74_Msk            (0x1UL << IAC_ISR2_IAF74_Pos)              /*!< 0x00000400 */
#define IAC_ISR2_IAF74                IAC_ISR2_IAF74_Msk
#define IAC_ISR2_IAF75_Pos            (11U)
#define IAC_ISR2_IAF75_Msk            (0x1UL << IAC_ISR2_IAF75_Pos)              /*!< 0x00000800 */
#define IAC_ISR2_IAF75                IAC_ISR2_IAF75_Msk
#define IAC_ISR2_IAF76_Pos            (12U)
#define IAC_ISR2_IAF76_Msk            (0x1UL << IAC_ISR2_IAF76_Pos)              /*!< 0x00001000 */
#define IAC_ISR2_IAF76                IAC_ISR2_IAF76_Msk
#define IAC_ISR2_IAF77_Pos            (13U)
#define IAC_ISR2_IAF77_Msk            (0x1UL << IAC_ISR2_IAF77_Pos)              /*!< 0x00002000 */
#define IAC_ISR2_IAF77                IAC_ISR2_IAF77_Msk
#define IAC_ISR2_IAF78_Pos            (14U)
#define IAC_ISR2_IAF78_Msk            (0x1UL << IAC_ISR2_IAF78_Pos)              /*!< 0x00004000 */
#define IAC_ISR2_IAF78                IAC_ISR2_IAF78_Msk
#define IAC_ISR2_IAF79_Pos            (15U)
#define IAC_ISR2_IAF79_Msk            (0x1UL << IAC_ISR2_IAF79_Pos)              /*!< 0x00008000 */
#define IAC_ISR2_IAF79                IAC_ISR2_IAF79_Msk
#define IAC_ISR2_IAF80_Pos            (16U)
#define IAC_ISR2_IAF80_Msk            (0x1UL << IAC_ISR2_IAF80_Pos)              /*!< 0x00010000 */
#define IAC_ISR2_IAF80                IAC_ISR2_IAF80_Msk
#define IAC_ISR2_IAF81_Pos            (17U)
#define IAC_ISR2_IAF81_Msk            (0x1UL << IAC_ISR2_IAF81_Pos)              /*!< 0x00020000 */
#define IAC_ISR2_IAF81                IAC_ISR2_IAF81_Msk
#define IAC_ISR2_IAF82_Pos            (18U)
#define IAC_ISR2_IAF82_Msk            (0x1UL << IAC_ISR2_IAF82_Pos)              /*!< 0x00040000 */
#define IAC_ISR2_IAF82                IAC_ISR2_IAF82_Msk
#define IAC_ISR2_IAF83_Pos            (19U)
#define IAC_ISR2_IAF83_Msk            (0x1UL << IAC_ISR2_IAF83_Pos)              /*!< 0x00080000 */
#define IAC_ISR2_IAF83                IAC_ISR2_IAF83_Msk
#define IAC_ISR2_IAF84_Pos            (20U)
#define IAC_ISR2_IAF84_Msk            (0x1UL << IAC_ISR2_IAF84_Pos)              /*!< 0x00100000 */
#define IAC_ISR2_IAF84                IAC_ISR2_IAF84_Msk
#define IAC_ISR2_IAF85_Pos            (21U)
#define IAC_ISR2_IAF85_Msk            (0x1UL << IAC_ISR2_IAF85_Pos)              /*!< 0x00200000 */
#define IAC_ISR2_IAF85                IAC_ISR2_IAF85_Msk
#define IAC_ISR2_IAF86_Pos            (22U)
#define IAC_ISR2_IAF86_Msk            (0x1UL << IAC_ISR2_IAF86_Pos)              /*!< 0x00400000 */
#define IAC_ISR2_IAF86                IAC_ISR2_IAF86_Msk
#define IAC_ISR2_IAF87_Pos            (23U)
#define IAC_ISR2_IAF87_Msk            (0x1UL << IAC_ISR2_IAF87_Pos)              /*!< 0x00800000 */
#define IAC_ISR2_IAF87                IAC_ISR2_IAF87_Msk
#define IAC_ISR2_IAF88_Pos            (24U)
#define IAC_ISR2_IAF88_Msk            (0x1UL << IAC_ISR2_IAF88_Pos)              /*!< 0x01000000 */
#define IAC_ISR2_IAF88                IAC_ISR2_IAF88_Msk
#define IAC_ISR2_IAF89_Pos            (25U)
#define IAC_ISR2_IAF89_Msk            (0x1UL << IAC_ISR2_IAF89_Pos)              /*!< 0x02000000 */
#define IAC_ISR2_IAF89                IAC_ISR2_IAF89_Msk
#define IAC_ISR2_IAF90_Pos            (26U)
#define IAC_ISR2_IAF90_Msk            (0x1UL << IAC_ISR2_IAF90_Pos)              /*!< 0x04000000 */
#define IAC_ISR2_IAF90                IAC_ISR2_IAF90_Msk
#define IAC_ISR2_IAF91_Pos            (27U)
#define IAC_ISR2_IAF91_Msk            (0x1UL << IAC_ISR2_IAF91_Pos)              /*!< 0x08000000 */
#define IAC_ISR2_IAF91                IAC_ISR2_IAF91_Msk
#define IAC_ISR2_IAF92_Pos            (28U)
#define IAC_ISR2_IAF92_Msk            (0x1UL << IAC_ISR2_IAF92_Pos)              /*!< 0x10000000 */
#define IAC_ISR2_IAF92                IAC_ISR2_IAF92_Msk
#define IAC_ISR2_IAF93_Pos            (29U)
#define IAC_ISR2_IAF93_Msk            (0x1UL << IAC_ISR2_IAF93_Pos)              /*!< 0x20000000 */
#define IAC_ISR2_IAF93                IAC_ISR2_IAF93_Msk
#define IAC_ISR2_IAF94_Pos            (30U)
#define IAC_ISR2_IAF94_Msk            (0x1UL << IAC_ISR2_IAF94_Pos)              /*!< 0x40000000 */
#define IAC_ISR2_IAF94                IAC_ISR2_IAF94_Msk
#define IAC_ISR2_IAF95_Pos            (31U)
#define IAC_ISR2_IAF95_Msk            (0x1UL << IAC_ISR2_IAF95_Pos)              /*!< 0x80000000 */
#define IAC_ISR2_IAF95                IAC_ISR2_IAF95_Msk

