zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211dxx_ca35.h
/***************  Bit definition for RNG_HWCFGR register  ****************/
#define RNG_HWCFGR_CFG1_Pos         (0U)
#define RNG_HWCFGR_CFG1_Msk         (0xFFUL << RNG_HWCFGR_CFG1_Pos)        /*!< 0x000000FF */
#define RNG_HWCFGR_CFG1             RNG_HWCFGR_CFG1_Msk                   /*!< HW Generic 1 */
#define RNG_HWCFGR_CFG2_Pos         (8U)
#define RNG_HWCFGR_CFG2_Msk         (0xFFUL << RNG_HWCFGR_CFG2_Pos)        /*!< 0x0000FF00 */
#define RNG_HWCFGR_CFG2             RNG_HWCFGR_CFG2_Msk                   /*!< HW Generic 2 */
#define RNG_HWCFGR_CFG3_Pos         (16U)
#define RNG_HWCFGR_CFG3_Msk         (0xFFUL << RNG_HWCFGR_CFG3_Pos)        /*!< 0x00FF0000 */
#define RNG_HWCFGR_CFG3             RNG_HWCFGR_CFG3_Msk                   /*!< HW Generic 3 */

/****************  Bit definition for RNG_VERR register  *****************/
#define RNG_VERR_MINREV_Pos         (0U)
#define RNG_VERR_MINREV_Msk         (0xFUL << RNG_VERR_MINREV_Pos)         /*!< 0x0000000F */
#define RNG_VERR_MINREV             RNG_VERR_MINREV_Msk                   /*!< Minor revision */
#define RNG_VERR_MAJREV_Pos         (4U)
#define RNG_VERR_MAJREV_Msk         (0xFUL << RNG_VERR_MAJREV_Pos)         /*!< 0x000000F0 */
#define RNG_VERR_MAJREV             RNG_VERR_MAJREV_Msk                   /*!< Major revision */

/****************  Bit definition for RNG_IPIDR register  ****************/
#define RNG_IPIDR_ID_Pos            (0U)
#define RNG_IPIDR_ID_Msk            (0xFFFFFFFFUL << RNG_IPIDR_ID_Pos)     /*!< 0xFFFFFFFF */
#define RNG_IPIDR_ID                RNG_IPIDR_ID_Msk                      /*!< Identification code of the peripheral */

/****************  Bit definition for RNG_SIDR register  *****************/
#define RNG_SIDR_SID_Pos            (0U)
#define RNG_SIDR_SID_Msk            (0xFFFFFFFFUL << RNG_SIDR_SID_Pos)     /*!< 0xFFFFFFFF */
#define RNG_SIDR_SID                RNG_SIDR_SID_Msk                      /*!< Size identification code */

/******************************************************************************/
/*                                                                            */
/*                           Real-Time Clock (RTC)                            */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RTC_TR register  *******************/
#define RTC_TR_SU_Pos                (0U)
#define RTC_TR_SU_Msk                (0xFUL << RTC_TR_SU_Pos)                            /*!< 0x0000000F */
#define RTC_TR_SU                    RTC_TR_SU_Msk
#define RTC_TR_SU_0                  (0x1UL << RTC_TR_SU_Pos)                            /*!< 0x00000001 */
#define RTC_TR_SU_1                  (0x2UL << RTC_TR_SU_Pos)                            /*!< 0x00000002 */
#define RTC_TR_SU_2                  (0x4UL << RTC_TR_SU_Pos)                            /*!< 0x00000004 */
#define RTC_TR_SU_3                  (0x8UL << RTC_TR_SU_Pos)                            /*!< 0x00000008 */
#define RTC_TR_ST_Pos                (4U)
#define RTC_TR_ST_Msk                (0x7UL << RTC_TR_ST_Pos)                            /*!< 0x00000070 */
#define RTC_TR_ST                    RTC_TR_ST_Msk
#define RTC_TR_ST_0                  (0x1UL << RTC_TR_ST_Pos)                            /*!< 0x00000010 */
#define RTC_TR_ST_1                  (0x2UL << RTC_TR_ST_Pos)                            /*!< 0x00000020 */
#define RTC_TR_ST_2                  (0x4UL << RTC_TR_ST_Pos)                            /*!< 0x00000040 */
#define RTC_TR_MNU_Pos               (8U)
#define RTC_TR_MNU_Msk               (0xFUL << RTC_TR_MNU_Pos)                           /*!< 0x00000F00 */
#define RTC_TR_MNU                   RTC_TR_MNU_Msk
#define RTC_TR_MNU_0                 (0x1UL << RTC_TR_MNU_Pos)                           /*!< 0x00000100 */
#define RTC_TR_MNU_1                 (0x2UL << RTC_TR_MNU_Pos)                           /*!< 0x00000200 */
#define RTC_TR_MNU_2                 (0x4UL << RTC_TR_MNU_Pos)                           /*!< 0x00000400 */
#define RTC_TR_MNU_3                 (0x8UL << RTC_TR_MNU_Pos)                           /*!< 0x00000800 */
#define RTC_TR_MNT_Pos               (12U)
#define RTC_TR_MNT_Msk               (0x7UL << RTC_TR_MNT_Pos)                           /*!< 0x00007000 */
#define RTC_TR_MNT                   RTC_TR_MNT_Msk
#define RTC_TR_MNT_0                 (0x1UL << RTC_TR_MNT_Pos)                           /*!< 0x00001000 */
#define RTC_TR_MNT_1                 (0x2UL << RTC_TR_MNT_Pos)                           /*!< 0x00002000 */
#define RTC_TR_MNT_2                 (0x4UL << RTC_TR_MNT_Pos)                           /*!< 0x00004000 */
#define RTC_TR_HU_Pos                (16U)
#define RTC_TR_HU_Msk                (0xFUL << RTC_TR_HU_Pos)                            /*!< 0x000F0000 */
#define RTC_TR_HU                    RTC_TR_HU_Msk
#define RTC_TR_HU_0                  (0x1UL << RTC_TR_HU_Pos)                            /*!< 0x00010000 */
#define RTC_TR_HU_1                  (0x2UL << RTC_TR_HU_Pos)                            /*!< 0x00020000 */
#define RTC_TR_HU_2                  (0x4UL << RTC_TR_HU_Pos)                            /*!< 0x00040000 */
#define RTC_TR_HU_3                  (0x8UL << RTC_TR_HU_Pos)                            /*!< 0x00080000 */
#define RTC_TR_HT_Pos                (20U)
#define RTC_TR_HT_Msk                (0x3UL << RTC_TR_HT_Pos)                            /*!< 0x00300000 */
#define RTC_TR_HT                    RTC_TR_HT_Msk
#define RTC_TR_HT_0                  (0x1UL << RTC_TR_HT_Pos)                            /*!< 0x00100000 */
#define RTC_TR_HT_1                  (0x2UL << RTC_TR_HT_Pos)                            /*!< 0x00200000 */
#define RTC_TR_PM_Pos                (22U)
#define RTC_TR_PM_Msk                (0x1UL << RTC_TR_PM_Pos)                            /*!< 0x00400000 */
#define RTC_TR_PM                    RTC_TR_PM_Msk

